"""Напишите программу, которая считает общую цену. Вводится M рублей и N копеек
   цена, а также количество S товара Посчитайте общую цену в рублях и копейках
   за L товаров.
"""


def total_sum(m, n, s):
    """Подсчет общей суммы покупок.

    :param m: рубли
    :param n: копейки
    :param s: количество товара
    :return: строка. общая цена в рублях и копейках. формат:
        'x rubles y kopecks'
    """
    # write your code here
    # Переводим рубли в копейки
    m = m * 100
    # Находим общую сумму копеек
    n = m + n
    cost = str((n * s) // 100) + ' rubles ' + str((n * s) % 100) + ' kopecks'
    return cost  # write return value here


if __name__ == '__main__':
    # здесь можно сделать ввод из консоли и проверить работу функции
    m, n, s = 756, 65, 34
    print(total_sum(m, n, s))
